FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC2478/LPC2478_LCDController.c
/*-------------------------------------------------------------------------*
 * File:  LCDController.c
 *-------------------------------------------------------------------------*
 * Description:
 *      HAL implementation of the LPC2478 LCD Controller.
 * Implementation:
 *      Most of the configuration comes down to the single table passed
 *      in.  From there, we map SDRAM to the LCD.
 *-------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------
 * uEZ(R) - Copyright (C) 2007-2010 Future Designs, Inc.
 *--------------------------------------------------------------------------
 * This file is part of the uEZ(R) distribution.  See the included
 * uEZLicense.txt or visit http://www.teamfdi.com/uez for details.
 *
 *    *===============================================================*
 *    |  Future Designs, Inc. can port uEZ(tm) to your own hardware!  |
 *    |             We can get you up and running fast!               |
 *    |      See http://www.teamfdi.com/uez for more details.         |
 *    *===============================================================*
 *
 *-------------------------------------------------------------------------*/
#include <uEZ.h>
#include <uEZBSP.h>
#include <uEZPlatform.h>
#include <uEZProcessor.h>
#include <uEZRTOS.h>
#include "LPC2478_LCDController.h"
#include <HAL/Interrupt.h>

 /*---------------------------------------------------------------------------*
 * Constants:
 *---------------------------------------------------------------------------*/
#define LCD_INT_LNBUIM          (1<<2) // for LCD VSync

/*---------------------------------------------------------------------------*
 * Types:
 *---------------------------------------------------------------------------*/
typedef struct {
    const HAL_LCDController *iHAL;
    TUInt32 iBaseAddress;
    TUInt16 iPalette[256];
	// uEZ 2.04
    LCDControllerVerticalSync iVerticalSyncCallbackFunc;
    void *iVerticalSyncCallbackWorkspace;
} T_workspace;

/*---------------------------------------------------------------------------*
 * Globals:
 *---------------------------------------------------------------------------*/
extern const HAL_LCDController LCDController_LPC2478_Interface;
static T_workspace *G_lpc2478_lcdWorkspace;

/*---------------------------------------------------------------------------*
 * Prototypes:
 *---------------------------------------------------------------------------*/
static void ILPC2478_ProcessVerticalSync(T_workspace *p);
T_uezError LPC2478_LCDController_DisableVerticalSync(void *aWorkspace);

/*---------------------------------------------------------------------------*
 * Routine:  LCDControllerVerticalIRQ
 *---------------------------------------------------------------------------*
 * Description:
 *      Interrupt handler for LCD interrupts.  Process the interrupt
 *      in ILPC2478_ProcessVerticalSync().
 *---------------------------------------------------------------------------*/
IRQ_ROUTINE(LCDControllerVerticalIRQ)
{
    IRQ_START();
    ILPC2478_ProcessVerticalSync(G_lpc2478_lcdWorkspace);
    IRQ_END();
}

/*---------------------------------------------------------------------------*
 * Routine:  ILPC2478_ProcessVerticalSync
 *---------------------------------------------------------------------------*
 * Description:
 *      Interrupt handler for LCD interrupts.  Process the interrupt
 *      in ILPC2478_ProcessVerticalSync().
 * Inputs:
 *      void *aWorkspace          -- Memory allocated for workspace area.
 * Outputs:
 *      T_uezError                 -- Error code
 *---------------------------------------------------------------------------*/
void ILPC2478_ProcessVerticalSync(T_workspace *p)
{
    // Determine the type of interrupt
    TUInt32 flags = LCD_INTSTAT;

    // Next base address updated?
    if (flags & LCD_INT_LNBUIM) {
        // Make the callback (if one is available)
        if (p->iVerticalSyncCallbackFunc) {
            // Make the callback
            p->iVerticalSyncCallbackFunc(p->iVerticalSyncCallbackWorkspace);
        }
    }

    // Clear any interrupts processed by this interrupt
    LCD_INTCLR = flags;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC2478_LCDController_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the workspace for this LCD Controller
 * Inputs:
 *      void *aWorkspace          -- Memory allocated for workspace area.
 * Outputs:
 *      T_uezError                 -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC2478_LCDController_InitializeWorkspace(void *aWorkspace)
{
    T_workspace *p = (T_workspace *)aWorkspace;
    p->iHAL = &LCDController_LPC2478_Interface;
    p->iBaseAddress = 0xA0000000;    // use default address
		// uEZ 2.04
    p->iVerticalSyncCallbackFunc = 0;
    p->iVerticalSyncCallbackWorkspace = 0;

    // Setup workspace for this space for interrupts
    G_lpc2478_lcdWorkspace = p;

    // Register interrupts for this LCD Controller
    InterruptRegister(INTERRUPT_CHANNEL_LCD, LCDControllerVerticalIRQ,
        INTERRUPT_PRIORITY_NORMAL, "VSync");
    InterruptDisable(INTERRUPT_CHANNEL_LCD);
		
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC2478_LCDController_Configure
 *---------------------------------------------------------------------------*
 * Description:
 *      Configure and setup the LCD screen with the given settings
 * Inputs:
 *      void *aWorkspace          -- LCD Controller's workspace
 *      T_LCDControllerSettings *aSettings -- Pointer to settings to use
 * Outputs:
 *      T_uezError                 -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC2478_LCDController_Configure(
            void *aWorkspace,
            T_LCDControllerSettings *aSettings)
{
#if 0
    static TUInt32 bitsPerPixel[] = {
	    1, // LCD_COLOR_RES_1=0,
	    2, // LCD_COLOR_RES_2,
	    4, // LCD_COLOR_RES_4,
	    8, // LCD_COLOR_RES_8,
	    16, // LCD_COLOR_RES_16_I555,  // first bit is intensity bit (1=high/0=low)
	    24, // LCD_COLOR_RES_24,	
	    16, //LCD_COLOR_RES_16_565,
	    16, //LCD_COLOR_RES_12_444,   // uses 16 bits to store 12 levels  0:R4:G4:B4
    };
#endif

    TUInt32 regValue = 0;
    TUInt32* pPal = 0;
    TUInt32 dotClockDivider;
    int i = 0;
    T_workspace *p = (T_workspace *)aWorkspace;
    TUInt32 calcDiv;

    // Turn on the power to the subsystem
    PCONP |= 0x00100000;        /* Power Control for CLCDC */

    // Disable ETM since LPC2478 shares these lines with LCD
    PINSEL10 = 0;

    // disable the display`
    LCD_CTRL &= ~LCD_CTRL_LcdEn;

