FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC2478/LPC2478_LCDController.c
    // Don't allow buffer overruns
    if (aColorIndex >= 256)
        return UEZ_ERROR_OUT_OF_RANGE;

    // Use the upper 5 bits of red, green, and blue
    // Creating a 5/5/5 palette entry (we'll leave the last bit always
    // 0 which for the LPC24xx family means intensity or unused).
    aPackedColor =
        ((aBlue>>11)&(0x1F<<0))|
        ((aGreen>>6)&(0x1F<<5))|
        ((aRed>>1)&(0x1F<<10));

    // Half and half, the index decides which half to use.
    // For now, going to assume we are MSB configured.
    pPal = ((TUInt32*) (&LCD_PAL0)) + (aColorIndex>>1);
    if (aColorIndex & 1) {
        neighbor = p->iPalette[aColorIndex-1];
        *pPal = (neighbor<<0) | (aPackedColor<<16);
    } else {
        neighbor = p->iPalette[aColorIndex];
        *pPal = (neighbor<<16) | (aPackedColor<<0);
    }
    // Remember this in the local palette
    p->iPalette[aColorIndex] = aPackedColor;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC2478_LCDController_EnableVerticalSync
 *---------------------------------------------------------------------------*
 * Description:
 *      Enable Vertical sync on LCD.
 * Inputs:
 *      void *aWorkspace                         -- LCD Controller's workspace
 *      LCDControllerVerticalSync aCallbackFunc  -- Call back function
 *      void *aCallbackWorkspace                 -- Call back workspace
 * Outputs:
 *      T_uezError                               -- If successful, returns
 *                                               UEZ_ERROR_NONE.
 *---------------------------------------------------------------------------*/
T_uezError LPC2478_LCDController_EnableVerticalSync(
    void *aWorkspace,
    LCDControllerVerticalSync aCallbackFunc,
    void *aCallbackWorkspace)
{
    T_workspace *p = (T_workspace *)aWorkspace;

    // Disable the interrupt
    if (p->iVerticalSyncCallbackFunc)
        LPC2478_LCDController_DisableVerticalSync(aWorkspace);

    p->iVerticalSyncCallbackFunc = aCallbackFunc;
    p->iVerticalSyncCallbackWorkspace = aCallbackWorkspace;

    // Enable the mask
    LCD_INTMSK |= LCD_INT_LNBUIM;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC2478_LCDController_DisableVerticalSync
 *---------------------------------------------------------------------------*
 * Description:
 *      Disable Vertical sync on LCD.
 * Inputs:
 *      void *aWorkspace       -- LCD Controller's workspace
 * Outputs:
 *      T_uezError             -- If successful, returns UEZ_ERROR_NONE.
 *---------------------------------------------------------------------------*/
T_uezError LPC2478_LCDController_DisableVerticalSync(void *aWorkspace)
{
    T_workspace *p = (T_workspace *)aWorkspace;

    if (p->iVerticalSyncCallbackFunc) {
        // Disable the mask (if it was on)
        LCD_INTMSK &= ~LCD_INT_LNBUIM;

        p->iVerticalSyncCallbackFunc = 0;
        p->iVerticalSyncCallbackWorkspace = 0;
    }

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Requirement routines:
 *---------------------------------------------------------------------------*/
void LPC2478_LCDController_Require(const T_LPC2478_LCDController_Pins *aPins)
{
    static const T_LPC2478_PINSEL_ConfigList pinsVD0[] = {
            {GPIO_P0_4,  1}, // LCD_VD0
            {GPIO_P2_6,  3}, // LCD_VD0
    };
    static const T_LPC2478_PINSEL_ConfigList pinsVD1[] = {
            {GPIO_P0_5,  1}, // LCD_VD1
            {GPIO_P2_7,  3}, // LCD_VD1
    };
    static const T_LPC2478_PINSEL_ConfigList pinsVD2[] = {
            {GPIO_P2_8,  3}, // LCD_VD2
            {GPIO_P4_28, 2}, // LCD_VD2
    };
    static const T_LPC2478_PINSEL_ConfigList pinsVD3[] = {
            {GPIO_P2_9,  3}, // LCD_VD3
            {GPIO_P2_12, 1}, // LCD_VD3
            {GPIO_P4_29, 2}, // LCD_VD3
    };
    static const T_LPC2478_PINSEL_ConfigList pinsVD4[] = {
            {GPIO_P2_6,  3}, // LCD_VD4
            {GPIO_P2_12, 1}, // LCD_VD4
    };
    static const T_LPC2478_PINSEL_ConfigList pinsVD5[] = {
            {GPIO_P2_7,  3}, // LCD_VD5
            {GPIO_P2_13, 1}, // LCD_VD5
    };
    static const T_LPC2478_PINSEL_ConfigList pinsVD6[] = {
            {GPIO_P1_20, 1}, // LCD_VD6
            {GPIO_P2_8,  3}, // LCD_VD6
            {GPIO_P4_28, 2}, // LCD_VD6
    };
    static const T_LPC2478_PINSEL_ConfigList pinsVD7[] = {
            {GPIO_P1_21, 1}, // LCD_VD7
            {GPIO_P2_9,  3}, // LCD_VD7
            {GPIO_P4_29, 2}, // LCD_VD7
    };
    static const T_LPC2478_PINSEL_ConfigList pinsVD8[] = {
            {GPIO_P0_6,  1}, // LCD_VD8
            {GPIO_P1_22, 1}, // LCD_VD8
            {GPIO_P2_12, 1}, // LCD_VD8
    };
    static const T_LPC2478_PINSEL_ConfigList pinsVD9[] = {
            {GPIO_P0_7,  1}, // LCD_VD9
            {GPIO_P1_23, 1}, // LCD_VD9
            {GPIO_P2_13, 1}, // LCD_VD9
    };
    static const T_LPC2478_PINSEL_ConfigList pinsVD10[] = {
            {GPIO_P1_20, 1}, // LCD_VD10
            {GPIO_P1_24, 1}, // LCD_VD10
            {GPIO_P4_28, 2}, // LCD_VD10
    };
    static const T_LPC2478_PINSEL_ConfigList pinsVD11[] = {
            {GPIO_P1_21, 1}, // LCD_VD11
            {GPIO_P1_25, 1}, // LCD_VD11
            {GPIO_P4_29, 2}, // LCD_VD11
    };
    static const T_LPC2478_PINSEL_ConfigList pinsVD12[] = {
            {GPIO_P1_22, 1}, // LCD_VD12
            {GPIO_P1_26, 1}, // LCD_VD12
    };
    static const T_LPC2478_PINSEL_ConfigList pinsVD13[] = {
            {GPIO_P1_23, 1}, // LCD_VD13
            {GPIO_P1_27, 1}, // LCD_VD13
    };
    static const T_LPC2478_PINSEL_ConfigList pinsVD14[] = {
            {GPIO_P1_24, 1}, // LCD_VD14
            {GPIO_P1_28, 1}, // LCD_VD14
    };
    static const T_LPC2478_PINSEL_ConfigList pinsVD15[] = {
            {GPIO_P1_25, 1}, // LCD_VD15
            {GPIO_P1_29, 1}, // LCD_VD15
    };
    static const T_LPC2478_PINSEL_ConfigList pinsVD16[] = {
            {GPIO_P0_8,  1}, // LCD_VD16
    };
    static const T_LPC2478_PINSEL_ConfigList pinsVD17[] = {
            {GPIO_P0_9,  1}, // LCD_VD17
    };
    static const T_LPC2478_PINSEL_ConfigList pinsVD18[] = {
            {GPIO_P2_12, 1}, // LCD_VD18
    };
    static const T_LPC2478_PINSEL_ConfigList pinsVD19[] = {
            {GPIO_P2_13, 1}, // LCD_VD19
    };
    static const T_LPC2478_PINSEL_ConfigList pinsVD20[] = {
            {GPIO_P1_26, 1}, // LCD_VD20
    };
    static const T_LPC2478_PINSEL_ConfigList pinsVD21[] = {
            {GPIO_P1_27, 1}, // LCD_VD21
    };
    static const T_LPC2478_PINSEL_ConfigList pinsVD22[] = {
            {GPIO_P1_28, 1}, // LCD_VD22
    };
    static const T_LPC2478_PINSEL_ConfigList pinsVD23[] = {
            {GPIO_P1_29, 1}, // LCD_VD23
    };
    static const T_LPC2478_PINSEL_ConfigList pinsPWR[] = {
            {GPIO_P2_0,  3}, // LCD_PWR
    };
    static const T_LPC2478_PINSEL_ConfigList pinsLE[] = {
            {GPIO_P2_1,  3}, // LCD_LE
    };
    static const T_LPC2478_PINSEL_ConfigList pinsDCLK[] = {
            {GPIO_P2_2,  3}, // LCD_DCLK
    };
    static const T_LPC2478_PINSEL_ConfigList pinsFP[] = {
            {GPIO_P2_3,  3}, // LCD_FP
    };
    static const T_LPC2478_PINSEL_ConfigList pinsENAB[] = {
            {GPIO_P2_4,  3}, // LCD_ENAB_M
    };
    static const T_LPC2478_PINSEL_ConfigList pinsLP[] = {
            {GPIO_P2_5,  3}, // LCD_LP
    };
    static const T_LPC2478_PINSEL_ConfigList pinsCLKIN[] = {
            {GPIO_P2_11, 1}, // LCD_CLKIN
    };

    HAL_DEVICE_REQUIRE_ONCE();

    // Register LCD Controller
    HALInterfaceRegister("LCDController",
            (T_halInterface *)&LCDController_LPC2478_Interface, 0, 0);
    LPC2478_PINSEL_ConfigPinOrNone(aPins->iPWR, pinsPWR,
            ARRAY_COUNT(pinsPWR));
    LPC2478_PINSEL_ConfigPinOrNone(aPins->iLE, pinsLE,
            ARRAY_COUNT(pinsLE));
    LPC2478_PINSEL_ConfigPinOrNone(aPins->iDCLK, pinsDCLK,
            ARRAY_COUNT(pinsDCLK));
    LPC2478_PINSEL_ConfigPinOrNone(aPins->iFP, pinsFP,
            ARRAY_COUNT(pinsFP));
    LPC2478_PINSEL_ConfigPinOrNone(aPins->iENAB_M, pinsENAB,
            ARRAY_COUNT(pinsENAB));
    LPC2478_PINSEL_ConfigPinOrNone(aPins->iLP, pinsLP,
            ARRAY_COUNT(pinsLP));

