FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC2478/LPC2478_LCDController.c
    LPC2478_PINSEL_ConfigPinOrNone(aPins->iVD[0], pinsVD0,
            ARRAY_COUNT(pinsVD0));
    LPC2478_PINSEL_ConfigPinOrNone(aPins->iVD[1], pinsVD1,
            ARRAY_COUNT(pinsVD1));
    LPC2478_PINSEL_ConfigPinOrNone(aPins->iVD[2], pinsVD2,
            ARRAY_COUNT(pinsVD2));
    LPC2478_PINSEL_ConfigPinOrNone(aPins->iVD[3], pinsVD3,
            ARRAY_COUNT(pinsVD3));
    LPC2478_PINSEL_ConfigPinOrNone(aPins->iVD[4], pinsVD4,
            ARRAY_COUNT(pinsVD4));
    LPC2478_PINSEL_ConfigPinOrNone(aPins->iVD[5], pinsVD5,
            ARRAY_COUNT(pinsVD5));
    LPC2478_PINSEL_ConfigPinOrNone(aPins->iVD[6], pinsVD6,
            ARRAY_COUNT(pinsVD6));
    LPC2478_PINSEL_ConfigPinOrNone(aPins->iVD[7], pinsVD7,
            ARRAY_COUNT(pinsVD7));
    LPC2478_PINSEL_ConfigPinOrNone(aPins->iVD[8], pinsVD8,
            ARRAY_COUNT(pinsVD8));
    LPC2478_PINSEL_ConfigPinOrNone(aPins->iVD[9], pinsVD9,
            ARRAY_COUNT(pinsVD9));

    LPC2478_PINSEL_ConfigPinOrNone(aPins->iVD[10], pinsVD10,
            ARRAY_COUNT(pinsVD10));
    LPC2478_PINSEL_ConfigPinOrNone(aPins->iVD[11], pinsVD11,
            ARRAY_COUNT(pinsVD11));
    LPC2478_PINSEL_ConfigPinOrNone(aPins->iVD[12], pinsVD12,
            ARRAY_COUNT(pinsVD12));
    LPC2478_PINSEL_ConfigPinOrNone(aPins->iVD[13], pinsVD13,
            ARRAY_COUNT(pinsVD13));
    LPC2478_PINSEL_ConfigPinOrNone(aPins->iVD[14], pinsVD14,
            ARRAY_COUNT(pinsVD14));
    LPC2478_PINSEL_ConfigPinOrNone(aPins->iVD[15], pinsVD15,
            ARRAY_COUNT(pinsVD15));
    LPC2478_PINSEL_ConfigPinOrNone(aPins->iVD[16], pinsVD16,
            ARRAY_COUNT(pinsVD16));
    LPC2478_PINSEL_ConfigPinOrNone(aPins->iVD[17], pinsVD17,
            ARRAY_COUNT(pinsVD17));
    LPC2478_PINSEL_ConfigPinOrNone(aPins->iVD[18], pinsVD18,
            ARRAY_COUNT(pinsVD18));
    LPC2478_PINSEL_ConfigPinOrNone(aPins->iVD[19], pinsVD19,
            ARRAY_COUNT(pinsVD19));

    LPC2478_PINSEL_ConfigPinOrNone(aPins->iVD[20], pinsVD20,
            ARRAY_COUNT(pinsVD20));
    LPC2478_PINSEL_ConfigPinOrNone(aPins->iVD[21], pinsVD21,
            ARRAY_COUNT(pinsVD21));
    LPC2478_PINSEL_ConfigPinOrNone(aPins->iVD[22], pinsVD22,
            ARRAY_COUNT(pinsVD22));
    LPC2478_PINSEL_ConfigPinOrNone(aPins->iVD[23], pinsVD23,
            ARRAY_COUNT(pinsVD23));

    LPC2478_PINSEL_ConfigPinOrNone(aPins->iCLKIN, pinsCLKIN,
            ARRAY_COUNT(pinsCLKIN));

    // Directly change the priorities of the AHB1 bus
    // We want the LCD to have a higher configuration than the
    // rest to avoid flickering when accessing the NOR flash
    // and running the LCD screen.
    //   3322 2222 2222 1111 1111 1100 0000 0000
    //   1098 7654 3210 9876 5432 1098 7654 3210
    //   0--- ---- ---- ---- ---- ---- ---- ----    31: Reserved
    //   -101 ---- ---- ---- ---- ---- ---- ---- 30-28: LCD priority 5 (highest)
    //   ---- 0--- ---- ---- ---- ---- ---- ----    27: Reserved
    //   ---- -011 ---- ---- ---- ---- ---- ---- 26-24: USB priority 3 (middle)
    //   ---- ---- 0--- ---- ---- ---- ---- ----    23: Reserved
    //   ---- ---- -001 ---- ---- ---- ---- ---- 22-20: AHB1 priority 1 (lowest)
    //   ---- ---- ---- 0--- ---- ---- ---- ----    19: Reserved
    //   ---- ---- ---- -100 ---- ---- ---- ---- 18-16: GPDMA priority 4 (next to highest)
    //   ---- ---- ---- ---- 0--- ---- ---- ----    15: Reserved
    //   ---- ---- ---- ---- -010 ---- ---- ---- 14-12: CPU prioirty 2 (next to lowest)
    //   ---- ---- ---- ---- ---- 0--- ---- ----    11: Reserved
    //   ---- ---- ---- ---- ---- -001 ---- ----  10-8: Master 1 (CPU) is the default master
    //   ---- ---- ---- ---- ---- ---- 0100 ----   7-4: Premeptive, re-aribtrate after 16 AHB quanta
    //   ---- ---- ---- ---- ---- ---- ---- 0---     3: A quanta is an AHB bus cycle
    //   ---- ---- ---- ---- ---- ---- ---- -10-   2-1: Break all defined length bursts greater than 8-beat
    //   ---- ---- ---- ---- ---- ---- ---- ---0     0: Priority scheduling
    AHBCFG1 = 0x53142144; // original
}

/*---------------------------------------------------------------------------*
 * HAL Interface table:
 *---------------------------------------------------------------------------*/
const HAL_LCDController LCDController_LPC2478_Interface = {
    "LPC2478 LCDController",
    0x0100,
    LPC2478_LCDController_InitializeWorkspace,
    sizeof(T_workspace),

    LCDCONTROLLER_FEATURE_POWER|
        LCDCONTROLLER_FEATURE_DUAL_PANEL|
        LCDCONTROLLER_FEATURE_DYNAMIC_BASE_ADDR|
        LCDCONTROLLER_FEATURE_PALETTE_CONTROL,

    LPC2478_LCDController_Configure,
    LPC2478_LCDController_On,
    LPC2478_LCDController_Off,
    LPC2478_LCDController_SetBacklightLevel,
    LPC2478_LCDController_SetBaseAddr,
    LPC2478_LCDController_SetPaletteColor,

    // v2.04
    LPC2478_LCDController_EnableVerticalSync,
    LPC2478_LCDController_DisableVerticalSync
};

/*-------------------------------------------------------------------------*
 * End of File:  LCDController.c
 *-------------------------------------------------------------------------*/
